init.org
#+title: Elyk's Emacs Config
#+startup: nofold
#+property: header-args :results silent :tangle yes
#+auto_tangle: t

* Lexical Keybinds
Until Emacs 24.1 (June 2012), Elisp only had dynamically scoped variables,
a feature, mostly by accident, common to old lisp dialects. While dynamic
scope has some selective uses, it’s widely regarded as a mistake for local
variables, and virtually no other languages have adopted it.
#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src
* Startup
** Early Init
Starting in Emacs 27 the early-init.el file is run before the GUI is created, so
we take care of a few misc. GUI features. Keeps ugliness down and should help
startup time, too.
#+begin_src emacs-lisp :tangle ./early-init.el
; -*- lexical-binding: t; -*-

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))
(setq gc-cons-percentage 0.6)

(setq read-process-output-max (* 1024 1024))

;; Compile warnings
;;  (setq warning-minimum-level :emergency)
(setq native-comp-async-report-warnings-errors nil) ;; native-comp warning
(setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

;; Don't enable packages at startup
(setq package-enable-at-startup nil)

;; MISC OPTIMIZATIONS ----
;;; optimizations (froom Doom's core.el). See that file for descriptions.
(setq idle-update-delay 1.0)

;; Disabling bidi (bidirectional editing stuff)
(setq-default bidi-display-reordering 'left-to-right
              bidi-paragraph-direction 'left-to-right)
(setq bidi-inhibit-bpa t)  ; emacs 27 only - disables bidirectional parenthesis

(setq-default cursor-in-non-selected-windows nil)
(setq highlight-nonselected-windows nil)
(setq fast-but-imprecise-scrolling t)
(setq inhibit-compacting-font-caches t)

;; Don't pop up UI dialogs when prompting
(setq use-dialog-box nil)

(when (fboundp 'startup-redirect-eln-cache)
  (startup-redirect-eln-cache
   (convert-standard-filename
	  (expand-file-name  "var/eln-cache/" user-emacs-directory))))

;; ENCODING -------------
(set-language-environment "UTF-8")

;; set-language-environment sets default-input-method, which is unwanted
(setq default-input-method nil)

;; Escape exit everything
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; For evil mode
(global-set-key (kbd "C-M-u") 'universal-argument)
#+end_src
** Packages (straight.el)
Trying out straight.el to manage my packages. So far so good.
#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(setq straight-use-package-by-default t)
(setq use-package-verbose nil)
;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)
#+end_src
** Garbage Collections/Collector
#+begin_src emacs-lisp
;; Thanks but no thanks
(setq inhibit-startup-screen t)
(use-package gcmh
  :diminish gcmh-mode
  :config
  (setq gcmh-idle-delay 5
        gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
  (gcmh-mode 1))

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-percentage 0.1))) ;; Default value for `gc-cons-percentage'

(add-hook 'emacs-startup-hook
          (lambda ()
            (message "Emacs ready in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))
#+end_src
* Files, variables, etc
** Setting custom variables and functions
*** Variables
These are variables which defines the looks of emacs and common files.
#+begin_src emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Calculated variables ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;

;; Set `elk/computer' to 'gpd or 'laptop.
(let ((sys (system-name)))
  (if (string= sys "gpdskynet")
      (setq elk/computer 'gpd)
    (setq elk/computer 'laptop)))

;;;;;;;;;;;;;;;;;;;;;;
;; Custom variables ;;
;;;;;;;;;;;;;;;;;;;;;;

(defcustom elk-doom-modeline-text-height nil "My preferred modeline text height.")
(defcustom elk-text-height nil "My preferred default text height.")
(defcustom elk-larger-text nil "Larger text height.")
(defcustom elk-default-line-spacing 0 "Baseline line spacing.")

(if (eq elk/computer 'gpd)
    (setq elk-text-height 120
          elk-larger-text 140)
  (setq elk-text-height 140
        elk-larger-text 160))

(if (eq elk/computer 'gpd)
    (setq elk-doom-modeline-text-height 120)
  (setq elk-doom-modeline-text-height 140))

(setq elk/init.org (expand-file-name "init.org" user-emacs-directory))
(setq org-directory (file-truename "~/Documents/org"))
(setq org-roam-directory org-directory)
#+end_src
*** Functions
**** Window functions
#+begin_src emacs-lisp
(defun elk/split-window-vertically-and-switch ()
  (interactive)
  (split-window-vertically)
  (other-window 1))

(defun elk/split-window-horizontally-and-switch ()
  (interactive)
  (split-window-horizontally)
  (other-window 1))

;; from https://gist.github.com/3402786
(defun elk/toggle-maximize-buffer ()
  "Maximize buffer"
  (interactive)
  (if (and (= 1 (length (window-list)))
           (assoc ?_ register-alist))
      (jump-to-register ?_)
    (progn
      (window-configuration-to-register ?_)
      (delete-other-windows))))
#+end_src
**** Evil Functions
#+begin_src emacs-lisp
;;;###autoload
(defun +evil-shift-left ()
  "vnoremap < <gv"
  (interactive)
  (call-interactively #'evil-shift-left)
  (evil-normal-state)
  (evil-visual-restore))

;;;###autoload
(defun +evil-shift-right ()
  "vnoremap > >gv"
  (interactive)
  (call-interactively #'evil-shift-right)
  (evil-normal-state)
  (evil-visual-restore))

;;;###autoload
(defun +evil-org-< ()
  "vnoremap < <gv"
  (interactive)
  (call-interactively #'evil-org-<)
  (evil-normal-state)
  (evil-visual-restore))

;;;###autoload
(defun +evil-org-> ()
  "vnoremap > >gv"
  (interactive)
  (call-interactively #'evil-org->)
  (evil-normal-state)
  (evil-visual-restore))
#+end_src
