init.org
** Line numbers, fringe, hl-line
The way I've configured line numbers is they are on by default, and then in specific modes they are turned off. Seems to work. As for fringes, they're fairly wide. I think those three setq-default lines are from Prot.
#+begin_src emacs-lisp
(setq-default fringes-outside-margins nil)
(setq-default indicate-buffer-boundaries nil) ;; Otherwise shows a corner icon on the edge
(setq-default indicate-empty-lines nil) ;; Otherwise there are weird fringes on blank lines

(set-face-attribute 'fringe nil :background nil)
(set-face-attribute 'header-line nil :background nil :inherit 'default)

;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1)))
  (add-hook mode (lambda () (hl-line-mode 1))))

;; Override some modes which derive from the above
(dolist (mode '(org-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; This makes emacs transparent
(set-frame-parameter (selected-frame) 'alpha '(95 . 95))
(add-to-list 'default-frame-alist '(alpha . (95 . 95)))
#+end_src
** DISABLED Dashboard
Emacs Dashboard is an extensible startup screen showing you recent files, bookmarks, agenda items and an Emacs banner.
#+begin_src emacs-lisp :tangle no
(use-package dashboard
  :init      ;; tweak dashboard config before loading it
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "\nKEYBINDINGS:\
\nFind file               (SPC .)     \
Open buffer list    (SPC b i)\
\nFind recent files       (SPC f r)   \
Open the eshell     (SPC e s)\
\nOpen dired file manager (SPC d d)   \
List of keybindings (SPC h b b)")
  ;;(setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
  (setq dashboard-startup-banner (file-truename "/media/emacs/gnu/emacs-dash.png"))  ;; use custom image as banner
  (setq dashboard-center-content nil) ;; set to 't' for centered content
  (setq dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 5)
                          (projects . 5)
                          (registers . 5)))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))
#+end_src
** Writeroom + Visual-Fill-Column
Visual fill column centers the buffer and limits the width. Writeroom is a nicer writing enviroment. Usually I activate ~writeroom-mode~ as it activates ~visual-fill-column-mode~.
#+begin_src emacs-lisp
;; Make fill-paragraph (M-q) 100 characters long
(setq-default fill-column 100)

(use-package visual-fill-column
  :defer t
  :commands visual-fill-column-mode
  :init
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t))

(use-package writeroom-mode
  :defer t
  :config
  (setq writeroom-maximize-window nil
        writeroom-header-line "" ;; Makes sure we have a header line, that's blank
        writeroom-mode-line t
        writeroom-global-effects nil) ;; No need to have Writeroom do any of that silly stuff
  (setq writeroom-width 70)
  ;; (add-hook 'writeroom-mode-hook (lambda () (setq-local line-spacing 10)))
  )
#+end_src
** Evil Goggles
#+begin_src emacs-lisp
(use-package evil-goggles
  :custom-face
  (evil-goggles-default-face ((t (:inherit 'highlight)))) ;; default is to inherit 'region
  ;; run `M-x list-faces-display` in a fresh emacs to get a list of faces on your emacs
  :init
  (setq evil-goggles-duration 0.1
        evil-goggles-pulse nil ; too slow
        ;; evil-goggles provides a good indicator of what has been affected.
        ;; delete/change is obvious, so I'd rather disable it for these.
        evil-goggles-enable-delete nil
        evil-goggles-enable-change nil)
  :config
  (evil-goggles-mode))
#+end_src
* Org-mode
** Org-mode packages
*** Org-super-agenda
#+begin_src emacs-lisp
(use-package org-super-agenda
    :after org
    :config
    (setq org-super-agenda-header-map nil) ;; takes over 'j'
    (setq org-super-agenda-header-prefix " ◦ ") ;; There are some unicode "THIN SPACE"s after the ◦
    (org-super-agenda-mode))
#+end_src
*** Org-superstar
I disabled superstar in favour of ~org-modern~ which is much more beautiful.
#+begin_src emacs-lisp
(use-package org-superstar
  :disabled t
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("◉" "○" "✸" "✿" "✤" "✜" "◆" "▶")
        org-superstar-leading-bullet ?\s
        org-superstar-leading-fallback ?\s
        org-superstar-item-bullet-alist '((?+ . ?➤) (?- . ?✦)) ; changes +/- symbols in item lists
        org-superstar-prettify-item-bullets t
        org-hide-leading-stars nil)
  (setq org-superstar-special-todo-items t  ;; Makes TODO header bullets into boxes
        org-superstar-todo-bullet-alist '(("TODO" . 9744)
                                          ("INPROG-TODO" . 9744)
                                          ("HW" . 9744)
                                          ("STUDY" . 9744)
                                          ("SOMEDAY" . 9744)
                                          ("READ" . 9744)
                                          ("PROJ" . 9744)
                                          ("CONTACT" . 9744)
                                          ("DONE" . 9745)))
  )

;; Removes gap when you add a new heading
;;(setq org-blank-before-new-entry '((heading . nil) (plain-list-item . nil)))
#+end_src
*** Org Modern
#+begin_src emacs-lisp  
(use-package org-modern
  :custom
  (org-modern-hide-stars nil) ; adds extra indentation
  :hook
  (org-mode . org-modern-mode)
  (org-agenda-finalize . org-modern-agenda))

(use-package org-modern-indent
  :straight (:host github :repo "jdtsmith/org-modern-indent")
  :hook
  (org-mode . org-modern-indent-mode))
#+end_src
*** Evil Org
#+begin_src emacs-lisp
(use-package evil-org
  :hook (org-mode . evil-org-mode)
  :diminish evil-org-mode
  :config
  (add-hook 'evil-org-mode-hook
            (lambda () (evil-org-set-key-theme)))
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src
*** Org-gcal
#+begin_src emacs-lisp
(use-package org-gcal
    :defer t
    :config
    (setq org-gcal-down-days '20) ;; Only fetch events 20 days into the future
    (setq org-gcal-up-days '10) ;; Only fetch events 10 days into the past
    (setq org-gcal-recurring-events-mode 'top-level)
    (setq org-gcal-remove-api-cancelled-events t) ;; No prompt when deleting removed events

    ;; NOTE - org-gcal ids and calendar configuation is set in 'private.el' for sake of security/privacy.
    )
#+end_src
*** Org-appear
#+begin_src emacs-lisp
(use-package org-appear
    :commands (org-appear-mode)
    :hook (org-mode . org-appear-mode)
    :init
    (setq org-hide-emphasis-markers t) ;; A default setting that needs to be t for org-appear
    (setq org-appear-autoemphasis t)  ;; Enable org-appear on emphasis (bold, italics, etc)
    (setq org-appear-autolinks nil) ;; Enable on links
    (setq org-appear-autosubmarkers t)) ;; Enable on subscript and superscript
#+end_src
*** Toc-org
#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enable
  :hook (org-mode . toc-org-enable)
  :config
  (setq toc-org-hrefify-default "gh"))
#+end_src
*** Org-auto-tangle
Tangle-on-save has revolutionized my literate programming workflow. It
automatically runs =org-babel-tangle= upon saving any org-mode buffer, which means
the resulting files will be automatically kept up to date. For a while I did
this by manually adding =org-babel-tangle= to the after-save hook in Org mode, but
now I use the [[https://github.com/yilkalargaw/org-auto-tangle][org-auto-tangle]] package, which does this asynchronously and
selectively for each Org file where it is desired.
#+begin_src emacs-lisp
(use-package org-auto-tangle
  :commands org-auto-tangle-mode
  :hook (org-mode . org-auto-tangle-mode))
#+end_src
*** Org-reveal
#+begin_src emacs-lisp
(use-package ox-reveal
  :after org)
#+end_src
*** Org-download
#+begin_src emacs-lisp
(defun elk/org-download-paste-clipboard (&optional use-default-filename)
  (interactive "P")
  (require 'org-download)
  (let ((file
         (if (not use-default-filename)
             (read-string (format "Filename [%s]: "
                                  org-download-screenshot-basename)
                          nil nil org-download-screenshot-basename)
           nil)))
    (org-download-clipboard file)))

(use-package org-download
  :after org
  :config
  (setq org-download-method 'directory)
  (setq org-download-image-dir "images")
  (setq org-download-heading-lvl nil)
  (setq org-download-timestamp "%Y%m%d-%H%M%S_")
  (setq org-image-actual-width 300))
#+end_src
*** Org-modules
#+begin_src emacs-lisp
(setq org-modules '(org-habit))
(eval-after-load 'org
    '(org-load-modules-maybe t))
#+end_src
*** Block Templates
These templates enable you to type things like =<el= and then hit =Tab= to expand
the template.  More documentation can be found at the Org Mode [[https://orgmode.org/manual/Easy-templates.html][Easy Templates]]
documentation page.
#+begin_src emacs-lisp
(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
(add-to-list 'org-structure-template-alist '("n" . "notes"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("li" . "src lisp"))
(add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
(add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("go" . "src go"))
(add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
(add-to-list 'org-structure-template-alist '("json" . "src json"))
#+end_src
** Org Bindings
For the rest of them go to [[Org Mode Bindings][here]]
#+begin_src emacs-lisp
;; Org-agenda specific bindings
(with-eval-after-load 'evil
  (evil-define-key 'motion org-agenda-mode-map
    (kbd "f") 'org-agenda-later
    (kbd "b") 'org-agenda-earlier))

(general-def 'org-mode-map
  ;; Emacs bindings
  "C-c t" 'elk/org-done-keep-todo)

(general-def 'visual org-mode-map
  [remap +evil-shift-left] '+evil-org-< ; vnoremap < <gv
  [remap +evil-shift-right] '+evil-org-> ; vnoremap > >gv
  )
#+end_src
** Org Custom Startup Functions
*** Org Font Setup
Titles get bigger, drawers are smaller, done checkboxes turn green. Also setting stuff to always be fixed-pitch.
#+begin_src emacs-lisp
(defun elk/org-font-setup ()
  (custom-theme-set-faces
   'user
   ;; '(org-level-4 ((t (:inherit t :height 1.1))))
   ;; '(org-level-3 ((t (:inherit t :height 1.25))))
   ;; '(org-level-2 ((t (:inherit t :height 1.5))))
   ;; '(org-level-1 ((t (:inherit t :height 1.75))))
   '(org-block ((t (:foreground nil))))
   '(org-tag ((t (:inherit org-tag :italic t))))
   '(org-ellipsis ((t (:inherit shadow :height 0.8))))
   '(org-link ((t (:foreground "royal blue" :underline t)))))

  ;; (mixed-pitch-mode 1)
  )
#+end_src
*** Org Prettify Function
#+begin_src emacs-lisp
(defun elk/prettify-symbols-setup ()
  ;; checkboxes
  (push '("[ ]" .  "☐") prettify-symbols-alist)
  ;; (push '("[X]" . "☑" ) prettify-symbols-alist)
  (push '("[X]" . "☒" ) prettify-symbols-alist)
  (push '("[-]" . "❍" ) prettify-symbols-alist)
  
  ;; org-babel
  (push '("#+BEGIN_SRC" . ?≫) prettify-symbols-alist)
  (push '("#+END_SRC" . ?≫) prettify-symbols-alist)
  (push '("#+begin_src" . ?≫) prettify-symbols-alist)
  (push '("#+end_src" . ?≫) prettify-symbols-alist)
  
  ;; (push '("#+BEGIN_SRC python" . ) prettify-symbols-alist) ;; This is the Python symbol. Comes up weird for some reason
  (push '("#+RESULTS:" . ?≚ ) prettify-symbols-alist)
  
  ;; drawers
  (push '(":PROPERTIES:" . ?) prettify-symbols-alist)
  
  ;; tags
  (push '(":Misc:" . "" ) prettify-symbols-alist)
  (push '(":ec:" . "" ) prettify-symbols-alist)
  (push '(":Weekly:ec:" . "" ) prettify-symbols-alist)
  (push '(":Robo:ec:" . "" ) prettify-symbols-alist)
  
  (push '(":bv:" . ? ) prettify-symbols-alist)
  (push '(":sp:" . ? ) prettify-symbols-alist)
  (push '(":cl:" . "π" ) prettify-symbols-alist)
  (push '(":ch:" . ?) prettify-symbols-alist)
  (push '(":es:" . "" ) prettify-symbols-alist)
  (prettify-symbols-mode 1))
#+end_src
*** Org Tables (from DOOM)
#+begin_src emacs-lisp
(defun +org-realign-table-maybe-h ()
  "Auto-align table under cursor."
  (when (and (org-at-table-p) org-table-may-need-update)
    (let ((pt (point))
          (inhibit-message t))
      (if org-table-may-need-update (org-table-align))
      (goto-char pt))))

(defun +org-realign-table-maybe-a (&rest _)
  "Auto-align table under cursor and re-calculate formulas."
  (when (eq major-mode 'org-mode)
    (+org-realign-table-maybe-h)))

;; From DOOM Emacs
(defun +org-enable-auto-reformat-tables-h ()
  "Realign tables & update formulas when exiting insert mode (`evil-mode').
Meant for `org-mode-hook'."
  (when (featurep 'evil)
    (add-hook 'evil-insert-state-exit-hook #'+org-realign-table-maybe-h nil t)
    (add-hook 'evil-replace-state-exit-hook #'+org-realign-table-maybe-h nil t)
    (advice-add #'evil-replace :after #'+org-realign-table-maybe-a)))
#+end_src
*** Main Org Setup
#+begin_src emacs-lisp
(defun elk/org-setup ()
  (org-indent-mode) ;; Keeps org items like text under headings, lists, nicely indented
  (visual-line-mode 1) ;; Nice line wrapping
  (visual-fill-column-mode 1) ;; Make the document centered with 100 words.

  (centered-cursor-mode)

  ;; (setq header-line-format "") ;; Empty header line, basically adds a blank line on top
  (setq-local line-spacing (+ elk-default-line-spacing 1)))
#+end_src
** Org Mode Config
*** Preamble
#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . +org-enable-auto-reformat-tables-h)
  :hook (org-mode . elk/org-setup)
  :hook (org-mode . elk/prettify-symbols-setup)
  :hook (org-mode . elk/org-font-setup)
  :hook (org-mode . locally-defer-font-lock)
  :hook (org-capture-mode . evil-insert-state) ;; Start org-capture in Insert state by default
  :diminish org-indent-mode
  :diminish visual-line-mode
  :config
#+end_src
The following is org-mode configuration.
*** Visuals
#+begin_src emacs-lisp
(setq org-ellipsis " ⬎ ") ;; ▼
(setq org-src-fontify-natively t) ;; Syntax highlighting in org src blocks
(setq org-highlight-latex-and-related '(native)) ;; Highlight inline LaTeX
(setq org-startup-folded 'showall)
(setq org-image-actual-width nil)
#+end_src
